# Explore here

In [65]:
import kagglehub

# Download latest version
path = kagglehub.dataset_download("loveall/appliances-energy-prediction")

print("Path to dataset files:", path)

Path to dataset files: /home/vscode/.cache/kagglehub/datasets/loveall/appliances-energy-prediction/versions/1

In [66]:
import os

dataset_path = "/home/vscode/.cache/kagglehub/datasets/loveall/appliances-energy-prediction/versions/1"

# Listar archivos en la carpeta
files = os.listdir(dataset_path)
print(files)

['KAG_energydata_complete.csv']

In [67]:
import pandas as pd

# Ruta del archivo (ajusta según el resultado del paso anterior)
csv_file = os.path.join(dataset_path, "KAG_energydata_complete.csv")

# Cargar el CSV en un DataFrame
df = pd.read_csv(csv_file)

# Mostrar las primeras filas
df.head()

,date,Appliances,lights,T1,RH_1,T2,RH_2,T3,RH_3,T4,...,T9,RH_9,T_out,Press_mm_hg,RH_out,Windspeed,Visibility,Tdewpoint,rv1,rv2
0,2016-01-11 17:00:00,60,30,19.89,47.596667,19.2,44.790000,19.79,44.730000,19.000000,...,17.033333,45.53,6.600000,733.5,92.0,7.000000,63.000000,5.3,13.275433,13.275433
1,2016-01-11 17:10:00,60,30,19.89,46.693333,19.2,44.722500,19.79,44.790000,19.000000,...,17.066667,45.56,6.483333,733.6,92.0,6.666667,59.166667,5.2,18.606195,18.606195
2,2016-01-11 17:20:00,50,30,19.89,46.300000,19.2,44.626667,19.79,44.933333,18.926667,...,17.000000,45.50,6.366667,733.7,92.0,6.333333,55.333333,5.1,28.642668,28.642668
3,2016-01-11 17:30:00,50,40,19.89,46.066667,19.2,44.590000,19.79,45.000000,18.890000,...,17.000000,45.40,6.250000,733.8,92.0,6.000000,51.500000,5.0,45.410389,45.410389
4,2016-01-11 17:40:00,60,40,19.89,46.333333,19.2,44.530000,19.79,45.000000,18.890000,...,17.000000,45.40,6.133333,733.9,92.0,5.666667,47.666667,4.9,10.084097,10.084097

In [68]:
print(df.shape)
print(df.info())

(19735, 29)
<class 'pandas.core.frame.DataFrame'>
RangeIndex: 19735 entries, 0 to 19734
Data columns (total 29 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   date         19735 non-null  object
 1   Appliances   19735 non-null  int64
 2   lights       19735 non-null  int64
 3   T1           19735 non-null  float64
 4   RH_1         19735 non-null  float64
 5   T2           19735 non-null  float64
 6   RH_2         19735 non-null  float64
 7   T3           19735 non-null  float64
 8   RH_3         19735 non-null  float64
 9   T4           19735 non-null  float64
 10  RH_4         19735 non-null  float64
 11  T5           19735 non-null  float64
 12  RH_5         19735 non-null  float64
 13  T6           19735 non-null  float64
 14  RH_6         19735 non-null  float64
 15  T7           19735 non-null  float64
 16  RH_7         19735 non-null  float64
 17  T8           19735 non-null  float64
 18  RH_8         19735 non-null  float64
 19  T9           19735 non-null  float64
 20  RH_9         19735 non-null  float64
 21  T_out        19735 non-null  float64
 22  Press_mm_hg  19735 non-null  float64
 23  RH_out       19735 non-null  float64
 24  Windspeed    19735 non-null  float64
 25  Visibility   19735 non-null  float64
 26  Tdewpoint    19735 non-null  float64
 27  rv1          19735 non-null  float64
 28  rv2          19735 non-null  float64
dtypes: float64(26), int64(2), object(1)
memory usage: 4.4+ MB
None

In [69]:
df.columns

Index(['date', 'Appliances', 'lights', 'T1', 'RH_1', 'T2', 'RH_2', 'T3',
       'RH_3', 'T4', 'RH_4', 'T5', 'RH_5', 'T6', 'RH_6', 'T7', 'RH_7', 'T8',
       'RH_8', 'T9', 'RH_9', 'T_out', 'Press_mm_hg', 'RH_out', 'Windspeed',
       'Visibility', 'Tdewpoint', 'rv1', 'rv2'],
      dtype='object')

In [70]:
df.shape

(19735, 29)

#ALMACENIMIENTO DE BASE DE DATOS

In [ ]:
import sqlite3
import pandas as pdLL

# Connect to the database or create it if it doesn't exist
con = sqlite3.connect("consumo_energetico.db")

### CREATE: Generate a table named COMPANY with 5 columns: ID, NAME, AGE, ADDRESS and SALARY
con.execute("""CREATE TABLE consumo_energetico(
    FECHA           DATE     NOT NULL,
    ELECTRODOMESTICOS    INT    NOT NULL,
    LUCES          INT     NOT NULL,
    TEMP_COCINA    FLOAT NOT NULL,
    HUM_COCINA     FLOAT NOT NULL,
    TEMP_EXTERIOR  FLOAT NOT NULL,
    HUM_EXTERIOR   FLOAT NOT NULL,
    TEMP_LAVADERO  FLOAT NOT NULL,
    HUM_LAVADERO   FLOAT NOT NULL,
    TEMP_ESTUDIO   FLOAT NOT NULL,
    HUM_ESTUDIO    FLOAT NOT NULL,
    TEMP_BAÑO      FLOAT NOT NULL,
    HUM_BAÑO       FLOAT NOT NULL,
    TEMP_CLOSET    FLOAT NOT NULL,
    HUM_CLOSET     FLOAT NOT NULL,
    TEMP_HAB_NIÑOS FLOAT NOT NULL,
    HUM_HAB_NIÑOS  FLOAT NOT NULL,
    TEMP_HAB_PADRES FLOAT NOT NULL,
    HUM_HAB_PADRES  FLOAT NOT NULL,
    TEM_ESTACION    FLOAT NOT NULL,
    HUM_ESTACION    FLOAT NOT NULL,
    PRESION_ESTACION  FLOAT NOT NULL,
    VEL_VIENTO_ESTACION  FLOAT NOT NULL,
    VISIBILIDAD_ESTACION FLOAT NOT NULL,
    PUNTO_ROCIO          FLOAT NOT NULL,
    VARIABLE_ALEATORIA1  FLOAT NOT NULL,
    VARIABLE_ALEATORIA2  FLOAT NOT NULL,
    
)""")

### INSERT: Insert records into the COMPANY table
con.execute("""INSERT INTO CONSUMO ENERGETICO VALUES (1,"2016-01-11 17:10:00",25,26,40,15,40,25,18, 15, 20,25,30,40,50,40, 40, 18, 15, 20,25,30,40,50,18,25,26,25)""")
con.commit()

### SELECT: Filter and print some of the table values
#  The cursor allows you to define a set of results
cursor = con.execute("SELECT * from CONSUMO ENERGETICO")
for row in cursor: # Iterate through all the rows of the resulting filter
    print(f"ID = {row[0]} FECHA = {row[1]} ELECTRODOMESTICOS = {row[2]} LUCES = {row[3]}")

# The results can also be stored in a DataFrame using Pandas
cursor_df = pd.read_sql_query("SELECT * FROM CONSUMO ENERGETICO", con)

### UPDATE: Update a record in the COMPANY table
con.execute("UPDATE CONSUMO ENERGETICO set ELECTRODOMESTICOS = 60 where ID = 1")
con.commit()

### DELETE: Delete a record from the COMPANY table
con.execute("DELETE from CONSUMO ENERGETICO where ID = 1")
con.commit()

### Terminate database connection
con.close()

OperationalError: near ")": syntax error